app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors"
---
  def index
    @professors = Professor.all

INSERT INTO "professors" ("name", "degree", "num_papers", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Soumik"], ["degree", "Electrical"], ["num_papers", -11], ["created_at", "2022-09-30 12:12:16.158519"], ["updated_at", "2022-09-30 12:12:16.158519"]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

UPDATE "professors" SET "num_papers" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["num_papers", 17], ["updated_at", "2022-10-01 14:00:01.918206"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @professor.update(professor_params)

DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 1]]
---
  def destroy
    @professor.destroy

SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params[:id])