app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "roll_no", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Yugesh"], ["roll_no", 1], ["created_at", "2022-09-29 11:54:04.882941"], ["updated_at", "2022-09-29 11:54:04.882941"]]